do 

local function run(msg, matches) 

local reply_id = msg['id'] 
if is_momod(msg) and matches[1] == 'م1' then 
    local ghost = [[ 
    👁‍🗨اوَامٌرَ الُاوَلُيَُه فَيَ الُمٌجْمٌوَْعُه👁‍🗨
✈️➖➖➖➖➖➖➖✈️
❣-معلوماتي↜↯
((لُْعرَضُ مٌْعلُوَمٌاتْ الُْعضُوَ))      

❣معلومات المجموعة↜↯
((لُْعرَضُ مٌْعلُوَمٌاتْ الُمٌجْمٌوَْعُه ))

❣-الاعدادات↜↯ 
((لُْعرَضُ الُاْعدِادِتْ فَيَ الُمٌجْمٌوَْعُه))

❣-موقعي↜↯
((لُْعرَضُ رَتْبّتْكِ فَيَ الُمٌجْمٌوَْعُه))   

❣-الاعضاء↜↯
((لُْعرَضُ الُاْعضُاء فَيَ الُمٌجْمٌوَْعُه))     
  
❣-رفع ادمن↜↯
((لُرَفَْع ادِمٌنَ فَيَ الُمٌجْمٌوَْعُه  )) 

❣-تنزيل ادمن↜↯
((لُتْنَزُيَلُ ادِمٌنَ فَيَ الُمٌجْمٌوَْعُه)) 

❣-الادمنيه↜↯
((لُْعرَضُ الُادِمٌنَيَُه فَيَ الُمٌجْمٌوَْعُه )) 
✈️➖➖➖➖➖➖➖✈️
🔭DEV : @Gowadbd
  CH : @arabic_android
  ]] 
  reply_msg(reply_id, ghost, ok_cb, false) 
end 

local reply_id = msg['id'] 
if not is_momod(msg) then 
local ghost = "عذرا ('..msg.from.print_name..') هذا الامر للمدراء فقط💡" 
reply_msg(reply_id, ghost, ok_cb, false) 
end 

end 
return { 
patterns ={ 
  "^(م1)$", 
}, 
run = run 
} 
end
